In [1]:
#Import Data Manipulation Library
import pandas  as pd 
import numpy as np

In [2]:
# Define a Series :1D Array 

a = pd.Series([1,2,3,4,5])
print(a)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [8]:
b = pd.Series([1,2,3,4,5],index= ['a,','b','c','d','e'])
b

a,    1
b     2
c     3
d     4
e     5
dtype: int64

In [9]:
#Using Concept of Indexing 
print(a.dtype)
print(a[3])
print(b['d'])

int64
4
4

C:\Users\HP\AppData\Local\Temp\ipykernel_17084\434434258.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(a[3])

In [12]:
# 2D 
c = pd.DataFrame({'India':[2000],'USA':[4000],'UK':[6000]})
print(c)

   India   USA    UK
0   2000  4000  6000

In [15]:
#Create Student Database
database = {'Name':['Nikhil','Aniket','Mihir','Tanvi','Hemangi'],
            'Age':[10,11,12,13,14,],
            'Marks':[34,56,67,68,79],
            'CGPA':[8,6,9,6,8]}
# Create a variable df: which will store dataframe
df = pd.DataFrame(database)
print(df)

      Name  Age  Marks  CGPA
0   Nikhil   10     34     8
1   Aniket   11     56     6
2    Mihir   12     67     9
3    Tanvi   13     68     6
4  Hemangi   14     79     8

In [18]:
df[df['Name'] == 'Tanvi']

    Name  Age  Marks  CGPA
3  Tanvi   13     68     6

In [20]:
df[df['Name'] == 'Aniket']

     Name  Age  Marks  CGPA
1  Aniket   11     56     6

In [21]:
# Usingagg() :Aggregate Function 
df['Marks'].agg(['min','max','mean'])

min     34.0
max     79.0
mean    60.8
Name: Marks, dtype: float64

In [22]:
df[df['Marks'] == 67]

    Name  Age  Marks  CGPA
2  Mihir   12     67     9

In [24]:
df[df['CGPA'] == 6]

     Name  Age  Marks  CGPA
1  Aniket   11     56     6
3   Tanvi   13     68     6

In [25]:
# Checking DataFrame Information
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   Marks   5 non-null      int64
 3   CGPA    5 non-null      int64
dtypes: int64(3), object(1)
memory usage: 292.0+ bytes

In [26]:
# This code will check if any missing value in dataset
df.isnull().sum()

Name     0
Age      0
Marks    0
CGPA     0
dtype: int64

In [27]:
print(df['Marks'].sum())
print(df['Marks'].mean())
print(df['Marks'].max())
print(df['Marks'].min())
print(df['Marks'].nunique())
print(df['Marks'].unique())
print(df['Name'].value_counts())
print(df['Marks'].value_counts())

304
60.8
79
34
5
[34 56 67 68 79]
Name
Nikhil     1
Aniket     1
Mihir      1
Tanvi      1
Hemangi    1
Name: count, dtype: int64
Marks
34    1
56    1
67    1
68    1
79    1
Name: count, dtype: int64

In [34]:
database = {'Name':['Nikhil','Aniket','Parag','Mihir','Ajay','Tanvi','Disha','Hemangi'],
            'Salary':[1000,2000,3000,4000,5000,6000,7000,8000],
            'No of Exp':[1,2,3,4,5,6,7,8],
            'Domain':['Tech','R&D','Non tech','Tech','R&D','HR','Non Tech','HR'],
            'Age':[21,22,23,24,25,26,27,28],
            'Gender':['Male','Female','Female','Female','Female','Male','Male','Male']}

company = pd.DataFrame(database)
print(company)

      Name  Salary  No of Exp    Domain  Age  Gender
0   Nikhil    1000          1      Tech   21    Male
1   Aniket    2000          2       R&D   22  Female
2    Parag    3000          3  Non tech   23  Female
3    Mihir    4000          4      Tech   24  Female
4     Ajay    5000          5       R&D   25  Female
5    Tanvi    6000          6        HR   26    Male
6    Disha    7000          7  Non Tech   27    Male
7  Hemangi    8000          8        HR   28    Male

In [37]:
#Checking the dataset information
company.info

<bound method DataFrame.info of       Name  Salary  No of Exp    Domain  Age  Gender
0   Nikhil    1000          1      Tech   21    Male
1   Aniket    2000          2       R&D   22  Female
2    Parag    3000          3  Non tech   23  Female
3    Mihir    4000          4      Tech   24  Female
4     Ajay    5000          5       R&D   25  Female
5    Tanvi    6000          6        HR   26    Male
6    Disha    7000          7  Non Tech   27    Male
7  Hemangi    8000          8        HR   28    Male>

In [39]:
# Evaluation maximum number of Exp from the dataset

print(company['No of Exp'].max())

8

In [40]:
print(company['No of Exp'].min())

1

In [41]:
print(company['No of Exp'].mean())

4.5

In [49]:
company[company['Gender'] == 'Female']

     Name  Salary  No of Exp    Domain  Age  Gender
1  Aniket    2000          2       R&D   22  Female
2   Parag    3000          3  Non tech   23  Female
3   Mihir    4000          4      Tech   24  Female
4    Ajay    5000          5       R&D   25  Female

In [53]:
F = company[company['Gender'] == 'Female']

In [54]:
F['Salary'].max()

5000

In [55]:
F[F['Salary'] == 5000]

   Name  Salary  No of Exp Domain  Age  Gender
4  Ajay    5000          5    R&D   25  Female

In [57]:
company['Gender'].value_counts()

Gender
Male      4
Female    4
Name: count, dtype: int64